[
  {
    "name": "Chain Mail",
    "description": "Mail or chain mail is a type of armour consisting of small metal rings linked together in a pattern to form a mesh. The word chainmail is of relatively recent coinage, having been in use only since the 1700s; prior to this it was referred to simply as mail. The word itself refers to the armour material, not the garment made from it. A shirt made from mail is a hauberk if knee-length, haubergeon if mid-thigh length, and byrnie if waist-length. Mail leggings are called chausses, mail hoods coif and mail mittens mitons. A mail collar hanging from a helmet is camail or aventail. A mail collar worn strapped around the neck was called a pixane or standard. In the Dark Ages chain mail was often referred to as ring maille to distinguish it from other types of mail, such as lamellar and splinted mail. In the Middle Ages scale mail died out, but chain mail remained, and people called it maille or mayle. As with heraldry, the language of armour is French, and chain mail is no exception. The word maille comes from the French, meaning mesh or net. The use of mail was prominent throughout the Dark Ages, High Middle Ages and Renaissance, and reached its apex in Europe, in terms of coverage, during the 13th century, when mail covered the whole body. By the 14th century, plate armour was commonly used to supplement mail. Eventually mail was supplanted by plate for the most part. However, mail was still widely used by many soldiers as well as brigandines and padded jacks. These three types of armour made up the bulk of the equipment used by soldiers with mail being the most expensive. It was quite often more expensive than plate armour. A mail shirt interwoven between two layers of fabric is called jazzeraint, and can be worn as protective clothing.",
    "image": "https://www.medievalwarfare.info/pics/knight..jpg"
  },
  {
    "name": "Plate Armour",
    "description": "Plate armour, which protected the chest and the lower limbs, was used by the ancient Greeks and Romans, but it fell into disuse after the collapse of the Roman Empire because of the cost and work involved in producing a lorica segmentata or comparable plate armour. Single plates of metal armour were again used from the late 13th century on, to protect joints and shins, and these were worn over a mail hauberk. By the end of the 14th century, larger and complete full plates of armour had been developed. During the early 1500s the helmet and neckguard design was reformed to produce the so-called Nürnberg armour, many of them masterpieces of workmanship and design.",
    "image": "https://www.medievalwarfare.info/pics/suit.jpg"
  },
  {
    "name": "Helmets",
    "description": "Helmets, or helms, are one of the best known artefacts from the middle ages. They have never fallen out of use but have evolved not only for military use, but for many other spheres of live where there is a danger of head injury - mines, horse and motor cycle riding, building sites and so on. The medieval version - or rather upwards of a dozen medieval versions - are also preserved in coats of arms where they form an essential part of the crest. Indeed crests were originally bird-like crests on the helmet.",
    "image": "https://www.medievalwarfare.info/pics/101204_1236.jpg"
  }
]
