[
    {
        "name": "Falchions",
        "description": "A falchion ( from Old French fauchon, ultimately from Latin falx sickle) is a one-handed, single-edged sword of European origin, whose design is reminiscent of the Persian scimitar. The weapon combined the weight and power of an axe with the versatility of a sword. Falchions are found in different forms from around the 11th century up to and including the sixteenth century. In some versions the falchion looks rather like the scramasax and later the sabre, and in some versions the form is irregular or like a machete with a crossguard. While some propose that encounters with the Islamic shamshir inspired its creation, these scimitars of Persia were not developed until long after the falchion. More likely, it was developed from farmer's and butcher's knives of the seax type or in the manner of the larger Messer. The shape concentrates more weight near the end, thus making it more effective for chopping strikes like an axe or cleaver. The blade designs of falchions varied widely across the continent and through the ages. They almost always included a single edge with a slight curve on the blade towards the point on the end and most were also affixed with a quilloned crossguard for the hilt in the manner of the contemporary long-swords. Unlike the double-edged swords of Europe, few actual swords of this type have survived to the present day; fewer than a dozen specimens are currently known. Two basic types can be identified Cleaver falchions : shaped very much like a large meat cleaver, or large bladed machete. Cusped falchions : The majority of the depictions in art reflect a design similar to that of the großes Messer. This blade style may have been influenced by the Turko-Mongol sabres that had reached the borders of Europe by the thirteenth century. This type of sword continues in use into the 16th. Century It sometimes presumed that these swords had a lower-than-average quality and status than the longer, more expensive swords. It is also possible that some falchions were used as tools between wars and fights, since they were very practical pieces of equipment. It is commonly thought that falchions were primarily a peasant's weapon[, but the weapon is commonly shown in illustrations of combat between mounted knights. Some later falchions were very ornate and used by the nobility. In particular, there is a very elaborately engraved and gold plated falchion from the 1560s in the Wallace Collection. This weapon is engraved with the personal coat of arms of Cosimo de' Medici, Duke of Florence. A number of weapons superficially similar to the falchion existed in Western Europe, including the Messer, hanger and the backsword.",
        "image": "https://www.medievalwarfare.info/pics/falchion.jpg"
    },
    {
        "name": "Arming Swords",
        "description": "The arming sword (also sometimes called a knight's or knightly sword) is the single handed cruciform sword of the High Middle Ages, in common use between ca. 1000 and 1350, remaining in rare use into the 16th century. Arming swords are generally considered to be descendant from the swords of the migration period and Vikings Typically used with a shield or buckler, the arming sword was the standard military sword of the knight (merely called a war sword, an ambiguous title given to many types of swords carried for battle) until technological changes led to the rise of the longsword in the late 13th century. There are many texts and pictures depicting effective arming sword combat without the benefit of a shield. According to Medieval texts, in the absence of a shield the empty (normally left) hand could be used for grabbing or grappling opponents. The arming sword was overall a light, versatile weapon capable of both cut and thrust combat; and normally boasts excellent balance. Although a variety of designs fall under the heading of 'arming sword', they are most commonly recognised as single-handed double-edged swords that were designed more for cutting than thrusting. Most 12th-14th century blades seem to vary between 30 and 32 inch blades. As a rule, arming swords began to polarise in design forms from the late 12th century, becoming either increasingly squat and heavily pointed, or longer and heavier in design. This would seem to reflect two separate methods of adapting the arming sword to combat increasingly tough armour; either to make the blade sufficiently heavy-duty to inflict blunt trauma through the armour, or narrow-pointed enough to pierce it with a thrust. Arguably these two forms of blade evolve into the longsword, and the cinquedea. It is a common weapon in period artwork, and there are many surviving examples in museums. The arming sword was worn by a knight even when not in armour, and he would be considered 'undressed' for public if he were without it. The first longswords were actually little more than two-handed arming swords, but the difference in length grew substantially as time passed. Long after these larger weapons came into use, the arming sword was retained as a common sidearm, eventually evolving into the cut & thrust swords of the Renaissance. Arming swords are sometimes incorrectly referred to as longswords or broadswords (the former actually refers to a long-bladed two-handed sword and the latter to a type of broad-bladed basket-hilted sword popular in the 17th and 18th centuries).",
        "image": "https://www.medievalwarfare.info/pics/arming.jpg"
    },
    {
        "name": "Longswords",
        "description": "The Longsword is a type of European sword used during the late medieval period, approximately 1350 to 1550 (with early and late use reaching into the 13th and 17th centuries, respectively). Longswords have long cruciform hilts with grips over 10 to 15in length providing room for two hands. Straight double-edged blades are often over 1 m to 1.2 m (40 to 48inches) length, and weigh typically between 1.2 and 2.4 kg (2½ to 5 lb), with light specimens just below 1 kg (2.2 lb), and heavy specimens just above 2 kg (4½ lb). The longsword is commonly held in combat with both hands, though some may be used single-handed. Longswords are used for hewing, slicing, and stabbing. The specific offensive purpose of an individual longsword is derived from its physical shape. All parts of the sword are used for offensive purposes, including the pommel and crossguard. The French épée bâtarde references the bastard sword, a type of longsword. English Medieval and Renaissance manuscripts refer to the longsword as the two hand sword. The terms hand-and-a-half sword, greatsword, and bastard sword are used colloquially to refer to longswords in general. The longsword, with its longer grip and blade, appears to have become popular during the 14th century and remained in common use, as shown through period art and tale, from 1250 to 1550. The longsword was a powerful and versatile weapon. For close personal infantry combat, however, the longsword was prized for its versatility and killing capability. Hand and a half swords were so called because they could be either a one or two handed sword. While nearly every longsword is in some way different from one another, most contain a few essential parts. The blade of the sword forms the cutting portion of the weapon and is usually double-edged. Blades came in a variety of shapes and sizes. Broad and thin blades are more effective for cutting-oriented longswords while thick tapering blades are found on varieties more effective at thrusting. However, all longswords were effective at cutting, slicing and thrusting and variations in form made only minor alterations in use. The hilt comprises the portion of the sword that is not the blade. Like the blade, hilts evolved and changed over time in response to fashion and as the swords were designed for different specific purposes. The blade of the medieval longsword is straight and predominantly double edged. The construction of the blade is relatively thin, with strength provided by careful blade geometry. Over time, the blades of longswords become slightly longer, thicker in cross-section, less wide, and considerably more pointed. This design change is largely attributed to the use of plate armour as an effective defence, more or less nullifying the ability of a sword cut to break through the armour system. Instead of cutting, long swords were then used more to thrust against opponents in plate armour, requiring a more acute point and a more rigid blade. However, the cutting capability of the longsword was never entirely removed, as in some later rapiers, but was supplanted in importance by thrusting capability. Blades differ considerably in cross-section, as well as in length and width. The two most basic forms of blade cross-section are the lenticular and diamond. Lenticular blades are shaped like thin doubly convex lenses, providing adequate thickness for strength in the centre of the weapon while maintaining a thin enough edge geometry to allow a proper cutting edge to be ground. The diamond shaped blade slopes directly up from the edges, without the curved elements of the lenticular blade. The central ridge produced by this angular geometry is known as a riser, the thickest portion of the blade that provides ample rigidity. These basic designs are supplemented by additional forging techniques that incorporated slightly different variations of these cross-sections. The most common among these variations is the use of fullers and hollow-ground blades. While both of these elements concern themselves with the removal of material from the blade, they differ primarily in location and final result. Fullers are grooves or channels that are removed from the blade, in longswords, usually running along the centre of the blade and originating at or slightly before the hilt. The removal of this material allows the smith to significantly lighten the weapon without compromising the strength to the same extent, much as in the engineering of steel I-beams. Though colloquially called blood-grooves, fullers were not designed, nor do they function, to allow blood to flow out of a wound more easily, nor to run off the sword. Fullers differ in number and thickness on swords, with some incredibly broad fullers spanning nearly the entire width of the weapon while smaller more numerous fullers are usually thinner. The length of fullers also displays variation - on some cutting blades the fuller may run nearly the entire length of the weapon, while the fuller stops one-third or half-way down other blades. Hollow-ground blades have concave portions of steel removed from each side of the riser, thinning the edge geometry while keeping a thickened area at the centre to provide strength for the blade. A variety of hilt styles exist for longswords, with the style of pommel and quillion (crossguard) changing over time to accommodate different blade properties and to fit emerging stylistic trends. Combat with the longsword was not so barbaric and crude as is often portrayed. Codified systems of fighting existed, with a variety of styles and teachers each providing a slightly different take on the art. The longsword was a quick, effective, and versatile weapon capable of deadly thrusts, slices, and cuts. The blade was generally used with both hands on the hilt, one resting close to or on the pommel. However, in some circumstances, the weapon may be used only with one hand. In a depiction of a duel, individuals may be seen wielding sharply pointed longswords in one hand, leaving the other hand open to manipulate the large dueling shield. Another variation of use comes from the use of armour. Half-swording was a manner of using both hands, one on the hilt and one on the blade, to better control the weapon in thrusts and jabs. This versatility was unique, as multiple works hold that the longsword provided the foundations for learning a variety of other weapons including spears, staves, and polearms.] Use of the longsword in attack was not limited only to use of the blade, however, as several Fechtbücher explain and depict use of the pommel and cross as offensive weapons. The cross has been shown to be used as a hook for tripping or knocking an opponent off balance.",
        "image": "https://www.medievalwarfare.info/pics/longsword.jpg"
    }
]